/*Задание. • Разработать класс геометрической фигуры по варианту,  заданной на плоскости линейными размерами (например, сторонами a,b,c в случае треугольника). • Предусмотреть возможность проверки существования фигуры, реализовать функции подсчета его площади и периметра. • В качестве UI-интерфейса использовать консольное приложение с интерфейсом командной строки, WinForms или WPF-приложение. 
 
Важно (!): • Тип геометрической фигуры не должен ничего выводить на «экран» и ничего считывать с «экрана». • Нельзя изменять линейные размеры после создания фигуры. • Не должно быть конструктора по-умолчанию, так как не может существовать фигура с нулевыми линейными размерами. Не нужно предоставлять возможность создавать объект в заведомо ошибочном состоянии. • В комментариях методов вычислений должно быть описание формул, по которым происходят вычисления, или их названия. • Обязательно должны быть «приглашения для ввода», и отображение результата, так чтобы пользователю было понятно, что отображается. 
ВАРИАНТ 4: Трапеция
 */

using System;

namespace TrapezoidShape
{
    class TrapezoidDriver
    {
        static void Main(string[] args)
        {

        }

        static void DisplayMainMenu()
        {
            Console.WriteLine("Main menu.");
        }
    }
}
